SoCXin/HC32F4A0/src/hc32f4a0sgtb_template/common/hc32f4a0sgtb.h
/*  Bit definition for ADC_AWDSCLRR register  */
#define ADC_AWDSCLRR_CLRAWD0F_POS                      (0U)
#define ADC_AWDSCLRR_CLRAWD0F                          (0x01U)
#define ADC_AWDSCLRR_CLRAWD1F_POS                      (1U)
#define ADC_AWDSCLRR_CLRAWD1F                          (0x02U)
#define ADC_AWDSCLRR_CLRAWDCMF_POS                     (4U)
#define ADC_AWDSCLRR_CLRAWDCMF                         (0x10U)

/*  Bit definition for ADC_AWD0DR0 register  */
#define ADC_AWD0DR0                                    (0xFFFFU)

/*  Bit definition for ADC_AWD0DR1 register  */
#define ADC_AWD0DR1                                    (0xFFFFU)

/*  Bit definition for ADC_AWD0CHSR register  */
#define ADC_AWD0CHSR_AWDCH                             (0x001FU)
#define ADC_AWD0CHSR_AWDCH_0                           (0x0001U)
#define ADC_AWD0CHSR_AWDCH_1                           (0x0002U)
#define ADC_AWD0CHSR_AWDCH_2                           (0x0004U)
#define ADC_AWD0CHSR_AWDCH_3                           (0x0008U)
#define ADC_AWD0CHSR_AWDCH_4                           (0x0010U)

/*  Bit definition for ADC_AWD1DR0 register  */
#define ADC_AWD1DR0                                    (0xFFFFU)

/*  Bit definition for ADC_AWD1DR1 register  */
#define ADC_AWD1DR1                                    (0xFFFFU)

/*  Bit definition for ADC_AWD1CHSR register  */
#define ADC_AWD1CHSR_AWDCH                             (0x001FU)

/*  Bit definition for ADC_PGACR register  */
#define ADC_PGACR_PGACTL_POS                           (0U)
#define ADC_PGACR_PGACTL                               (0x0FU)
#define ADC_PGACR_PGAGAIN_POS                          (4U)
#define ADC_PGACR_PGAGAIN                              (0xF0U)

/*  Bit definition for ADC_PGAVSSENR register  */
#define ADC_PGAVSSENR_PGAVSSEN                         (0x07U)

/*******************************************************************************
                Bit definition for Peripheral AES
*******************************************************************************/
/*  Bit definition for AES_CR register  */
#define AES_CR_START_POS                               (0U)
#define AES_CR_START                                   (0x00000001UL)
#define AES_CR_MODE_POS                                (1U)
#define AES_CR_MODE                                    (0x00000002UL)
#define AES_CR_KEYSIZE_POS                             (3U)
#define AES_CR_KEYSIZE                                 (0x00000018UL)

/*  Bit definition for AES_DR0 register  */
#define AES_DR0                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_DR1 register  */
#define AES_DR1                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_DR2 register  */
#define AES_DR2                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_DR3 register  */
#define AES_DR3                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_KR0 register  */
#define AES_KR0                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_KR1 register  */
#define AES_KR1                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_KR2 register  */
#define AES_KR2                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_KR3 register  */
#define AES_KR3                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_KR4 register  */
#define AES_KR4                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_KR5 register  */
#define AES_KR5                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_KR6 register  */
#define AES_KR6                                        (0xFFFFFFFFUL)

/*  Bit definition for AES_KR7 register  */
#define AES_KR7                                        (0xFFFFFFFFUL)

/*******************************************************************************
                Bit definition for Peripheral AOS
*******************************************************************************/
/*  Bit definition for AOS_INTSFTTRG register  */
#define AOS_INTSFTTRG_STRG                             (0x00000001UL)

/*  Bit definition for AOS_DCU_TRGSEL register  */
#define AOS_DCU_TRGSEL_TRGSEL_POS                      (0U)
#define AOS_DCU_TRGSEL_TRGSEL                          (0x000001FFUL)
#define AOS_DCU_TRGSEL_COMTRG_EN_POS                   (30U)
#define AOS_DCU_TRGSEL_COMTRG_EN                       (0xC0000000UL)
#define AOS_DCU_TRGSEL_COMTRG_EN_0                     (0x40000000UL)
#define AOS_DCU_TRGSEL_COMTRG_EN_1                     (0x80000000UL)

/*  Bit definition for AOS_DMA1_TRGSEL register  */
#define AOS_DMA1_TRGSEL_TRGSEL_POS                     (0U)
#define AOS_DMA1_TRGSEL_TRGSEL                         (0x000001FFUL)
#define AOS_DMA1_TRGSEL_COMTRG_EN_POS                  (30U)
#define AOS_DMA1_TRGSEL_COMTRG_EN                      (0xC0000000UL)
#define AOS_DMA1_TRGSEL_COMTRG_EN_0                    (0x40000000UL)
#define AOS_DMA1_TRGSEL_COMTRG_EN_1                    (0x80000000UL)

/*  Bit definition for AOS_DMA2_TRGSEL register  */
#define AOS_DMA2_TRGSEL_TRGSEL_POS                     (0U)
#define AOS_DMA2_TRGSEL_TRGSEL                         (0x000001FFUL)
#define AOS_DMA2_TRGSEL_COMTRG_EN_POS                  (30U)
#define AOS_DMA2_TRGSEL_COMTRG_EN                      (0xC0000000UL)
#define AOS_DMA2_TRGSEL_COMTRG_EN_0                    (0x40000000UL)
#define AOS_DMA2_TRGSEL_COMTRG_EN_1                    (0x80000000UL)

/*  Bit definition for AOS_DMA_TRGSELRC register  */
#define AOS_DMA_TRGSELRC_TRGSEL_POS                    (0U)
#define AOS_DMA_TRGSELRC_TRGSEL                        (0x000001FFUL)
#define AOS_DMA_TRGSELRC_COMTRG_EN_POS                 (30U)
#define AOS_DMA_TRGSELRC_COMTRG_EN                     (0xC0000000UL)
#define AOS_DMA_TRGSELRC_COMTRG_EN_0                   (0x40000000UL)
#define AOS_DMA_TRGSELRC_COMTRG_EN_1                   (0x80000000UL)

/*  Bit definition for AOS_TMR6_HTSSR register  */
#define AOS_TMR6_HTSSR_TRGSEL_POS                      (0U)
#define AOS_TMR6_HTSSR_TRGSEL                          (0x000001FFUL)
#define AOS_TMR6_HTSSR_COMTRG_EN_POS                   (30U)
#define AOS_TMR6_HTSSR_COMTRG_EN                       (0xC0000000UL)
#define AOS_TMR6_HTSSR_COMTRG_EN_0                     (0x40000000UL)
#define AOS_TMR6_HTSSR_COMTRG_EN_1                     (0x80000000UL)

