SoCXin/HC32F4A0/src/hc32f4a0sgtb_template/common/hc32f4a0sgtb.h
/*  Bit definition for AOS_PEVNTTRGSR register  */
#define AOS_PEVNTTRGSR_TRGSEL_POS                      (0U)
#define AOS_PEVNTTRGSR_TRGSEL                          (0x000001FFUL)
#define AOS_PEVNTTRGSR_COMTRG_EN_POS                   (30U)
#define AOS_PEVNTTRGSR_COMTRG_EN                       (0xC0000000UL)
#define AOS_PEVNTTRGSR_COMTRG_EN_0                     (0x40000000UL)
#define AOS_PEVNTTRGSR_COMTRG_EN_1                     (0x80000000UL)

/*  Bit definition for AOS_TMR0_HTSSR register  */
#define AOS_TMR0_HTSSR_TRGSEL_POS                      (0U)
#define AOS_TMR0_HTSSR_TRGSEL                          (0x000001FFUL)
#define AOS_TMR0_HTSSR_COMTRG_EN_POS                   (30U)
#define AOS_TMR0_HTSSR_COMTRG_EN                       (0xC0000000UL)
#define AOS_TMR0_HTSSR_COMTRG_EN_0                     (0x40000000UL)
#define AOS_TMR0_HTSSR_COMTRG_EN_1                     (0x80000000UL)

/*  Bit definition for AOS_TMR2_HTSSR register  */
#define AOS_TMR2_HTSSR_TRGSEL_POS                      (0U)
#define AOS_TMR2_HTSSR_TRGSEL                          (0x000001FFUL)
#define AOS_TMR2_HTSSR_COMTRG_EN_POS                   (30U)
#define AOS_TMR2_HTSSR_COMTRG_EN                       (0xC0000000UL)
#define AOS_TMR2_HTSSR_COMTRG_EN_0                     (0x40000000UL)
#define AOS_TMR2_HTSSR_COMTRG_EN_1                     (0x80000000UL)

/*  Bit definition for AOS_HASH_ITRGSELA register  */
#define AOS_HASH_ITRGSELA_TRGSEL_POS                   (0U)
#define AOS_HASH_ITRGSELA_TRGSEL                       (0x000001FFUL)
#define AOS_HASH_ITRGSELA_COMTRG_EN_POS                (30U)
#define AOS_HASH_ITRGSELA_COMTRG_EN                    (0xC0000000UL)
#define AOS_HASH_ITRGSELA_COMTRG_EN_0                  (0x40000000UL)
#define AOS_HASH_ITRGSELA_COMTRG_EN_1                  (0x80000000UL)

/*  Bit definition for AOS_HASH_ITRGSELB register  */
#define AOS_HASH_ITRGSELB_TRGSEL_POS                   (0U)
#define AOS_HASH_ITRGSELB_TRGSEL                       (0x000001FFUL)
#define AOS_HASH_ITRGSELB_COMTRG_EN_POS                (30U)
#define AOS_HASH_ITRGSELB_COMTRG_EN                    (0xC0000000UL)
#define AOS_HASH_ITRGSELB_COMTRG_EN_0                  (0x40000000UL)
#define AOS_HASH_ITRGSELB_COMTRG_EN_1                  (0x80000000UL)

/*  Bit definition for AOS_TMRA_HTSSR register  */
#define AOS_TMRA_HTSSR_TRGSEL_POS                      (0U)
#define AOS_TMRA_HTSSR_TRGSEL                          (0x000001FFUL)
#define AOS_TMRA_HTSSR_COMTRG_EN_POS                   (30U)
#define AOS_TMRA_HTSSR_COMTRG_EN                       (0xC0000000UL)
#define AOS_TMRA_HTSSR_COMTRG_EN_0                     (0x40000000UL)
#define AOS_TMRA_HTSSR_COMTRG_EN_1                     (0x80000000UL)

/*  Bit definition for AOS_OTS_TRG register  */
#define AOS_OTS_TRG_TRGSEL_POS                         (0U)
#define AOS_OTS_TRG_TRGSEL                             (0x000001FFUL)
#define AOS_OTS_TRG_COMTRG_EN_POS                      (30U)
#define AOS_OTS_TRG_COMTRG_EN                          (0xC0000000UL)
#define AOS_OTS_TRG_COMTRG_EN_0                        (0x40000000UL)
#define AOS_OTS_TRG_COMTRG_EN_1                        (0x80000000UL)

/*  Bit definition for AOS_ADC1_ITRGSELR register  */
#define AOS_ADC1_ITRGSELR_TRGSEL_POS                   (0U)
#define AOS_ADC1_ITRGSELR_TRGSEL                       (0x000001FFUL)
#define AOS_ADC1_ITRGSELR_COMTRG_EN_POS                (30U)
#define AOS_ADC1_ITRGSELR_COMTRG_EN                    (0xC0000000UL)
#define AOS_ADC1_ITRGSELR_COMTRG_EN_0                  (0x40000000UL)
#define AOS_ADC1_ITRGSELR_COMTRG_EN_1                  (0x80000000UL)

/*  Bit definition for AOS_ADC2_ITRGSELR register  */
#define AOS_ADC2_ITRGSELR_TRGSEL_POS                   (0U)
#define AOS_ADC2_ITRGSELR_TRGSEL                       (0x000001FFUL)
#define AOS_ADC2_ITRGSELR_COMTRG_EN_POS                (30U)
#define AOS_ADC2_ITRGSELR_COMTRG_EN                    (0xC0000000UL)
#define AOS_ADC2_ITRGSELR_COMTRG_EN_0                  (0x40000000UL)
#define AOS_ADC2_ITRGSELR_COMTRG_EN_1                  (0x80000000UL)

/*  Bit definition for AOS_ADC3_ITRGSELR register  */
#define AOS_ADC3_ITRGSELR_TRGSEL_POS                   (0U)
#define AOS_ADC3_ITRGSELR_TRGSEL                       (0x000001FFUL)
#define AOS_ADC3_ITRGSELR_COMTRG_EN_POS                (30U)
#define AOS_ADC3_ITRGSELR_COMTRG_EN                    (0xC0000000UL)
#define AOS_ADC3_ITRGSELR_COMTRG_EN_0                  (0x40000000UL)
#define AOS_ADC3_ITRGSELR_COMTRG_EN_1                  (0x80000000UL)

/*  Bit definition for AOS_COMTRG2 register  */
#define AOS_COMTRG2_TRGSEL                             (0x000001FFUL)

/*  Bit definition for AOS_COMTRG1 register  */
#define AOS_COMTRG1_TRGSEL                             (0x000001FFUL)

/*  Bit definition for AOS_PEVNTDIRR register  */
#define AOS_PEVNTDIRR_PDIR00_POS                       (0U)
#define AOS_PEVNTDIRR_PDIR00                           (0x00000001UL)
#define AOS_PEVNTDIRR_PDIR01_POS                       (1U)
#define AOS_PEVNTDIRR_PDIR01                           (0x00000002UL)
#define AOS_PEVNTDIRR_PDIR02_POS                       (2U)
#define AOS_PEVNTDIRR_PDIR02                           (0x00000004UL)
#define AOS_PEVNTDIRR_PDIR03_POS                       (3U)
#define AOS_PEVNTDIRR_PDIR03                           (0x00000008UL)
#define AOS_PEVNTDIRR_PDIR04_POS                       (4U)
#define AOS_PEVNTDIRR_PDIR04                           (0x00000010UL)
#define AOS_PEVNTDIRR_PDIR05_POS                       (5U)
#define AOS_PEVNTDIRR_PDIR05                           (0x00000020UL)
#define AOS_PEVNTDIRR_PDIR06_POS                       (6U)
#define AOS_PEVNTDIRR_PDIR06                           (0x00000040UL)
#define AOS_PEVNTDIRR_PDIR07_POS                       (7U)
#define AOS_PEVNTDIRR_PDIR07                           (0x00000080UL)
#define AOS_PEVNTDIRR_PDIR08_POS                       (8U)
#define AOS_PEVNTDIRR_PDIR08                           (0x00000100UL)
#define AOS_PEVNTDIRR_PDIR09_POS                       (9U)
#define AOS_PEVNTDIRR_PDIR09                           (0x00000200UL)
#define AOS_PEVNTDIRR_PDIR10_POS                       (10U)
#define AOS_PEVNTDIRR_PDIR10                           (0x00000400UL)
#define AOS_PEVNTDIRR_PDIR11_POS                       (11U)
#define AOS_PEVNTDIRR_PDIR11                           (0x00000800UL)
#define AOS_PEVNTDIRR_PDIR12_POS                       (12U)
#define AOS_PEVNTDIRR_PDIR12                           (0x00001000UL)
#define AOS_PEVNTDIRR_PDIR13_POS                       (13U)
#define AOS_PEVNTDIRR_PDIR13                           (0x00002000UL)
#define AOS_PEVNTDIRR_PDIR14_POS                       (14U)
#define AOS_PEVNTDIRR_PDIR14                           (0x00004000UL)
#define AOS_PEVNTDIRR_PDIR15_POS                       (15U)
#define AOS_PEVNTDIRR_PDIR15                           (0x00008000UL)

