SoCXin/HC32F4A0/src/hc32f4a0sgtb_template/common/hc32f4a0sgtb.h
/*  Bit definition for AOS_PEVNTRISR register  */
#define AOS_PEVNTRISR_RIS00_POS                        (0U)
#define AOS_PEVNTRISR_RIS00                            (0x00000001UL)
#define AOS_PEVNTRISR_RIS01_POS                        (1U)
#define AOS_PEVNTRISR_RIS01                            (0x00000002UL)
#define AOS_PEVNTRISR_RIS02_POS                        (2U)
#define AOS_PEVNTRISR_RIS02                            (0x00000004UL)
#define AOS_PEVNTRISR_RIS03_POS                        (3U)
#define AOS_PEVNTRISR_RIS03                            (0x00000008UL)
#define AOS_PEVNTRISR_RIS04_POS                        (4U)
#define AOS_PEVNTRISR_RIS04                            (0x00000010UL)
#define AOS_PEVNTRISR_RIS05_POS                        (5U)
#define AOS_PEVNTRISR_RIS05                            (0x00000020UL)
#define AOS_PEVNTRISR_RIS06_POS                        (6U)
#define AOS_PEVNTRISR_RIS06                            (0x00000040UL)
#define AOS_PEVNTRISR_RIS07_POS                        (7U)
#define AOS_PEVNTRISR_RIS07                            (0x00000080UL)
#define AOS_PEVNTRISR_RIS08_POS                        (8U)
#define AOS_PEVNTRISR_RIS08                            (0x00000100UL)
#define AOS_PEVNTRISR_RIS09_POS                        (9U)
#define AOS_PEVNTRISR_RIS09                            (0x00000200UL)
#define AOS_PEVNTRISR_RIS10_POS                        (10U)
#define AOS_PEVNTRISR_RIS10                            (0x00000400UL)
#define AOS_PEVNTRISR_RIS11_POS                        (11U)
#define AOS_PEVNTRISR_RIS11                            (0x00000800UL)
#define AOS_PEVNTRISR_RIS12_POS                        (12U)
#define AOS_PEVNTRISR_RIS12                            (0x00001000UL)
#define AOS_PEVNTRISR_RIS13_POS                        (13U)
#define AOS_PEVNTRISR_RIS13                            (0x00002000UL)
#define AOS_PEVNTRISR_RIS14_POS                        (14U)
#define AOS_PEVNTRISR_RIS14                            (0x00004000UL)
#define AOS_PEVNTRISR_RIS15_POS                        (15U)
#define AOS_PEVNTRISR_RIS15                            (0x00008000UL)

/*  Bit definition for AOS_PEVNTFAL register  */
#define AOS_PEVNTFAL_FAL00_POS                         (0U)
#define AOS_PEVNTFAL_FAL00                             (0x00000001UL)
#define AOS_PEVNTFAL_FAL01_POS                         (1U)
#define AOS_PEVNTFAL_FAL01                             (0x00000002UL)
#define AOS_PEVNTFAL_FAL02_POS                         (2U)
#define AOS_PEVNTFAL_FAL02                             (0x00000004UL)
#define AOS_PEVNTFAL_FAL03_POS                         (3U)
#define AOS_PEVNTFAL_FAL03                             (0x00000008UL)
#define AOS_PEVNTFAL_FAL04_POS                         (4U)
#define AOS_PEVNTFAL_FAL04                             (0x00000010UL)
#define AOS_PEVNTFAL_FAL05_POS                         (5U)
#define AOS_PEVNTFAL_FAL05                             (0x00000020UL)
#define AOS_PEVNTFAL_FAL06_POS                         (6U)
#define AOS_PEVNTFAL_FAL06                             (0x00000040UL)
#define AOS_PEVNTFAL_FAL07_POS                         (7U)
#define AOS_PEVNTFAL_FAL07                             (0x00000080UL)
#define AOS_PEVNTFAL_FAL08_POS                         (8U)
#define AOS_PEVNTFAL_FAL08                             (0x00000100UL)
#define AOS_PEVNTFAL_FAL09_POS                         (9U)
#define AOS_PEVNTFAL_FAL09                             (0x00000200UL)
#define AOS_PEVNTFAL_FAL10_POS                         (10U)
#define AOS_PEVNTFAL_FAL10                             (0x00000400UL)
#define AOS_PEVNTFAL_FAL11_POS                         (11U)
#define AOS_PEVNTFAL_FAL11                             (0x00000800UL)
#define AOS_PEVNTFAL_FAL12_POS                         (12U)
#define AOS_PEVNTFAL_FAL12                             (0x00001000UL)
#define AOS_PEVNTFAL_FAL13_POS                         (13U)
#define AOS_PEVNTFAL_FAL13                             (0x00002000UL)
#define AOS_PEVNTFAL_FAL14_POS                         (14U)
#define AOS_PEVNTFAL_FAL14                             (0x00004000UL)
#define AOS_PEVNTFAL_FAL15_POS                         (15U)
#define AOS_PEVNTFAL_FAL15                             (0x00008000UL)

/*  Bit definition for AOS_PEVNTNFCR register  */
#define AOS_PEVNTNFCR_NFEN1_POS                        (0U)
#define AOS_PEVNTNFCR_NFEN1                            (0x00000001UL)
#define AOS_PEVNTNFCR_DIVS1_POS                        (1U)
#define AOS_PEVNTNFCR_DIVS1                            (0x00000006UL)
#define AOS_PEVNTNFCR_NFEN2_POS                        (8U)
#define AOS_PEVNTNFCR_NFEN2                            (0x00000100UL)
#define AOS_PEVNTNFCR_DIVS2_POS                        (9U)
#define AOS_PEVNTNFCR_DIVS2                            (0x00000600UL)
#define AOS_PEVNTNFCR_NFEN3_POS                        (16U)
#define AOS_PEVNTNFCR_NFEN3                            (0x00010000UL)
#define AOS_PEVNTNFCR_DIVS3_POS                        (17U)
#define AOS_PEVNTNFCR_DIVS3                            (0x00060000UL)
#define AOS_PEVNTNFCR_NFEN4_POS                        (24U)
#define AOS_PEVNTNFCR_NFEN4                            (0x01000000UL)
#define AOS_PEVNTNFCR_DIVS4_POS                        (25U)
#define AOS_PEVNTNFCR_DIVS4                            (0x06000000UL)

/*******************************************************************************
                Bit definition for Peripheral CAN
*******************************************************************************/
/*  Bit definition for CAN_RBUF register  */
#define CAN_RBUF                                       (0xFFFFFFFFUL)

/*  Bit definition for CAN_TBUF register  */
#define CAN_TBUF                                       (0xFFFFFFFFUL)

/*  Bit definition for CAN_CFG_STAT register  */
#define CAN_CFG_STAT_BUSOFF_POS                        (0U)
#define CAN_CFG_STAT_BUSOFF                            (0x01U)
#define CAN_CFG_STAT_TACTIVE_POS                       (1U)
#define CAN_CFG_STAT_TACTIVE                           (0x02U)
#define CAN_CFG_STAT_RACTIVE_POS                       (2U)
#define CAN_CFG_STAT_RACTIVE                           (0x04U)
#define CAN_CFG_STAT_TSSS_POS                          (3U)
#define CAN_CFG_STAT_TSSS                              (0x08U)
#define CAN_CFG_STAT_TPSS_POS                          (4U)
#define CAN_CFG_STAT_TPSS                              (0x10U)
#define CAN_CFG_STAT_LBMI_POS                          (5U)
#define CAN_CFG_STAT_LBMI                              (0x20U)
#define CAN_CFG_STAT_LBME_POS                          (6U)
#define CAN_CFG_STAT_LBME                              (0x40U)
#define CAN_CFG_STAT_RESET_POS                         (7U)
#define CAN_CFG_STAT_RESET                             (0x80U)

/*  Bit definition for CAN_TCMD register  */
#define CAN_TCMD_TSA_POS                               (0U)
#define CAN_TCMD_TSA                                   (0x01U)
#define CAN_TCMD_TSALL_POS                             (1U)
#define CAN_TCMD_TSALL                                 (0x02U)
#define CAN_TCMD_TSONE_POS                             (2U)
#define CAN_TCMD_TSONE                                 (0x04U)
#define CAN_TCMD_TPA_POS                               (3U)
#define CAN_TCMD_TPA                                   (0x08U)
#define CAN_TCMD_TPE_POS                               (4U)
#define CAN_TCMD_TPE                                   (0x10U)
#define CAN_TCMD_LOM_POS                               (6U)
#define CAN_TCMD_LOM                                   (0x40U)
#define CAN_TCMD_TBSEL_POS                             (7U)
#define CAN_TCMD_TBSEL                                 (0x80U)

