SoCXin/HC32F4A0/src/hc32f4a0sgtb_template/common/hc32f4a0sgtb.h
/*  Bit definition for GPIO_PORRF register  */
#define GPIO_PORRF_POR00_POS                           (0U)
#define GPIO_PORRF_POR00                               (0x0001U)
#define GPIO_PORRF_POR01_POS                           (1U)
#define GPIO_PORRF_POR01                               (0x0002U)
#define GPIO_PORRF_POR02_POS                           (2U)
#define GPIO_PORRF_POR02                               (0x0004U)
#define GPIO_PORRF_POR03_POS                           (3U)
#define GPIO_PORRF_POR03                               (0x0008U)
#define GPIO_PORRF_POR04_POS                           (4U)
#define GPIO_PORRF_POR04                               (0x0010U)
#define GPIO_PORRF_POR05_POS                           (5U)
#define GPIO_PORRF_POR05                               (0x0020U)
#define GPIO_PORRF_POR06_POS                           (6U)
#define GPIO_PORRF_POR06                               (0x0040U)
#define GPIO_PORRF_POR07_POS                           (7U)
#define GPIO_PORRF_POR07                               (0x0080U)
#define GPIO_PORRF_POR08_POS                           (8U)
#define GPIO_PORRF_POR08                               (0x0100U)
#define GPIO_PORRF_POR09_POS                           (9U)
#define GPIO_PORRF_POR09                               (0x0200U)
#define GPIO_PORRF_POR10_POS                           (10U)
#define GPIO_PORRF_POR10                               (0x0400U)
#define GPIO_PORRF_POR11_POS                           (11U)
#define GPIO_PORRF_POR11                               (0x0800U)
#define GPIO_PORRF_POR12_POS                           (12U)
#define GPIO_PORRF_POR12                               (0x1000U)
#define GPIO_PORRF_POR13_POS                           (13U)
#define GPIO_PORRF_POR13                               (0x2000U)
#define GPIO_PORRF_POR14_POS                           (14U)
#define GPIO_PORRF_POR14                               (0x4000U)
#define GPIO_PORRF_POR15_POS                           (15U)
#define GPIO_PORRF_POR15                               (0x8000U)

/*  Bit definition for GPIO_POTRF register  */
#define GPIO_POTRF_POT00_POS                           (0U)
#define GPIO_POTRF_POT00                               (0x0001U)
#define GPIO_POTRF_POT01_POS                           (1U)
#define GPIO_POTRF_POT01                               (0x0002U)
#define GPIO_POTRF_POT02_POS                           (2U)
#define GPIO_POTRF_POT02                               (0x0004U)
#define GPIO_POTRF_POT03_POS                           (3U)
#define GPIO_POTRF_POT03                               (0x0008U)
#define GPIO_POTRF_POT04_POS                           (4U)
#define GPIO_POTRF_POT04                               (0x0010U)
#define GPIO_POTRF_POT05_POS                           (5U)
#define GPIO_POTRF_POT05                               (0x0020U)
#define GPIO_POTRF_POT06_POS                           (6U)
#define GPIO_POTRF_POT06                               (0x0040U)
#define GPIO_POTRF_POT07_POS                           (7U)
#define GPIO_POTRF_POT07                               (0x0080U)
#define GPIO_POTRF_POT08_POS                           (8U)
#define GPIO_POTRF_POT08                               (0x0100U)
#define GPIO_POTRF_POT09_POS                           (9U)
#define GPIO_POTRF_POT09                               (0x0200U)
#define GPIO_POTRF_POT10_POS                           (10U)
#define GPIO_POTRF_POT10                               (0x0400U)
#define GPIO_POTRF_POT11_POS                           (11U)
#define GPIO_POTRF_POT11                               (0x0800U)
#define GPIO_POTRF_POT12_POS                           (12U)
#define GPIO_POTRF_POT12                               (0x1000U)
#define GPIO_POTRF_POT13_POS                           (13U)
#define GPIO_POTRF_POT13                               (0x2000U)
#define GPIO_POTRF_POT14_POS                           (14U)
#define GPIO_POTRF_POT14                               (0x4000U)
#define GPIO_POTRF_POT15_POS                           (15U)
#define GPIO_POTRF_POT15                               (0x8000U)

/*  Bit definition for GPIO_PIDRG register  */
#define GPIO_PIDRG_PIN00_POS                           (0U)
#define GPIO_PIDRG_PIN00                               (0x0001U)
#define GPIO_PIDRG_PIN01_POS                           (1U)
#define GPIO_PIDRG_PIN01                               (0x0002U)
#define GPIO_PIDRG_PIN02_POS                           (2U)
#define GPIO_PIDRG_PIN02                               (0x0004U)
#define GPIO_PIDRG_PIN03_POS                           (3U)
#define GPIO_PIDRG_PIN03                               (0x0008U)
#define GPIO_PIDRG_PIN04_POS                           (4U)
#define GPIO_PIDRG_PIN04                               (0x0010U)
#define GPIO_PIDRG_PIN05_POS                           (5U)
#define GPIO_PIDRG_PIN05                               (0x0020U)
#define GPIO_PIDRG_PIN06_POS                           (6U)
#define GPIO_PIDRG_PIN06                               (0x0040U)
#define GPIO_PIDRG_PIN07_POS                           (7U)
#define GPIO_PIDRG_PIN07                               (0x0080U)
#define GPIO_PIDRG_PIN08_POS                           (8U)
#define GPIO_PIDRG_PIN08                               (0x0100U)
#define GPIO_PIDRG_PIN09_POS                           (9U)
#define GPIO_PIDRG_PIN09                               (0x0200U)
#define GPIO_PIDRG_PIN10_POS                           (10U)
#define GPIO_PIDRG_PIN10                               (0x0400U)
#define GPIO_PIDRG_PIN11_POS                           (11U)
#define GPIO_PIDRG_PIN11                               (0x0800U)
#define GPIO_PIDRG_PIN12_POS                           (12U)
#define GPIO_PIDRG_PIN12                               (0x1000U)
#define GPIO_PIDRG_PIN13_POS                           (13U)
#define GPIO_PIDRG_PIN13                               (0x2000U)
#define GPIO_PIDRG_PIN14_POS                           (14U)
#define GPIO_PIDRG_PIN14                               (0x4000U)
#define GPIO_PIDRG_PIN15_POS                           (15U)
#define GPIO_PIDRG_PIN15                               (0x8000U)

