SoCXin/HC32F4A0/src/hc32f4a0sgtb_template/common/hc32f4a0sgtb.h
/*  Bit definition for INTC_SEL52 register  */
#define INTC_SEL52_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL53 register  */
#define INTC_SEL53_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL54 register  */
#define INTC_SEL54_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL55 register  */
#define INTC_SEL55_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL56 register  */
#define INTC_SEL56_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL57 register  */
#define INTC_SEL57_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL58 register  */
#define INTC_SEL58_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL59 register  */
#define INTC_SEL59_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL60 register  */
#define INTC_SEL60_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL61 register  */
#define INTC_SEL61_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL62 register  */
#define INTC_SEL62_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL63 register  */
#define INTC_SEL63_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL64 register  */
#define INTC_SEL64_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL65 register  */
#define INTC_SEL65_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL66 register  */
#define INTC_SEL66_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL67 register  */
#define INTC_SEL67_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL68 register  */
#define INTC_SEL68_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL69 register  */
#define INTC_SEL69_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL70 register  */
#define INTC_SEL70_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL71 register  */
#define INTC_SEL71_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL72 register  */
#define INTC_SEL72_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL73 register  */
#define INTC_SEL73_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL74 register  */
#define INTC_SEL74_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL75 register  */
#define INTC_SEL75_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL76 register  */
#define INTC_SEL76_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL77 register  */
#define INTC_SEL77_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL78 register  */
#define INTC_SEL78_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL79 register  */
#define INTC_SEL79_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL80 register  */
#define INTC_SEL80_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL81 register  */
#define INTC_SEL81_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL82 register  */
#define INTC_SEL82_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL83 register  */
#define INTC_SEL83_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL84 register  */
#define INTC_SEL84_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL85 register  */
#define INTC_SEL85_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL86 register  */
#define INTC_SEL86_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL87 register  */
#define INTC_SEL87_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL88 register  */
#define INTC_SEL88_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL89 register  */
#define INTC_SEL89_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL90 register  */
#define INTC_SEL90_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL91 register  */
#define INTC_SEL91_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL92 register  */
#define INTC_SEL92_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL93 register  */
#define INTC_SEL93_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL94 register  */
#define INTC_SEL94_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL95 register  */
#define INTC_SEL95_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL96 register  */
#define INTC_SEL96_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL97 register  */
#define INTC_SEL97_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL98 register  */
#define INTC_SEL98_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL99 register  */
#define INTC_SEL99_INTSEL                              (0x000001FFUL)

/*  Bit definition for INTC_SEL100 register  */
#define INTC_SEL100_INTSEL                             (0x000001FFUL)

/*  Bit definition for INTC_SEL101 register  */
#define INTC_SEL101_INTSEL                             (0x000001FFUL)

/*  Bit definition for INTC_SEL102 register  */
#define INTC_SEL102_INTSEL                             (0x000001FFUL)

/*  Bit definition for INTC_SEL103 register  */
#define INTC_SEL103_INTSEL                             (0x000001FFUL)

/*  Bit definition for INTC_SEL104 register  */
#define INTC_SEL104_INTSEL                             (0x000001FFUL)

/*  Bit definition for INTC_SEL105 register  */
#define INTC_SEL105_INTSEL                             (0x000001FFUL)

